In [7]:
import pandas as pd
from sqlalchemy import create_engine, text

In [3]:
source_csv_url = "https://isba-salesorders.s3.amazonaws.com/Employees.csv"

source_csv_df = pd.read_csv(source_csv_url)

In [4]:
source_csv_df

,EmployeeID,EmpFirstName,EmpLastName,EmpStreetAddress,EmpCity,EmpState,EmpZipCode,EmpAreaCode,EmpPhoneNumber,EmpBirthDate
0,701,Ann,Patterson,16 Maple Lane,Auburn,WA,98002,253,555-2591,1958-03-18
1,702,Mary,Thompson,122 Spring River Drive,Duvall,WA,98019,425,555-2516,1990-06-21
2,703,Matt,Berg,908 W. Capital Way,Tacoma,WA,98413,253,555-2581,1964-11-02
3,704,Carol,Viescas,722 Moss Bay Blvd.,Kirkland,WA,98033,425,555-2576,1987-12-23
4,705,Kirk,DeGrasse,455 West Palm Ave,San Antonio,TX,78284,210,5552311,1985-10-05
5,706,David,Viescas,16679 NE 42nd Court,Redmond,WA,98052,425,555-2661,1968-01-01
6,707,Kathryn,Patterson,554 E. Wilshire\r\nApt. 2A,Seattle,WA,98105,206,555-2697,1982-12-12
7,708,Susan,McLain,511 Lenora Ave,Bellevue,WA,98006,425,555-2301,1967-10-15

In [5]:
raw_host = "isba-dev-01.cmhtgvzs0rf5.us-east-1.rds.amazonaws.com"
raw_username = "admin"
raw_password = "isba_4715"
raw_schema = "raw_SalesOrders"

raw_db_config = {
    "host": raw_host,
    "username": raw_username,
    "password": raw_password,
    "schema": raw_schema

}

# driver://username:password@host/database
raw_engine = create_engine(f"mysql+mysqldb://{raw_db_config['username']}:{raw_db_config['password']}@{raw_db_config['host']}/{raw_db_config['schema']}")

In [6]:
raw_table = "raw_Employees"

source_csv_df.to_sql(raw_table, raw_engine, index=False, if_exists="append")

8

In [8]:
raw_query = text(f'''
SELECT *    
FROM {raw_table}
WHERE inserted_at = (
    SELECT MAX(inserted_at)
    FROM {raw_table}
);      
''')

raw_df = pd.read_sql(raw_query, raw_engine)

In [9]:
raw_df

,EmployeeID,EmpFirstName,EmpLastName,EmpStreetAddress,EmpCity,EmpState,EmpZipCode,EmpAreaCode,EmpPhoneNumber,EmpBirthDate,inserted_at
0,701,Ann,Patterson,16 Maple Lane,Auburn,WA,98002,253,555-2591,1958-03-18,2024-04-03 20:22:20
1,702,Mary,Thompson,122 Spring River Drive,Duvall,WA,98019,425,555-2516,1990-06-21,2024-04-03 20:22:20
2,703,Matt,Berg,908 W. Capital Way,Tacoma,WA,98413,253,555-2581,1964-11-02,2024-04-03 20:22:20
3,704,Carol,Viescas,722 Moss Bay Blvd.,Kirkland,WA,98033,425,555-2576,1987-12-23,2024-04-03 20:22:20
4,705,Kirk,DeGrasse,455 West Palm Ave,San Antonio,TX,78284,210,5552311,1985-10-05,2024-04-03 20:22:20
5,706,David,Viescas,16679 NE 42nd Court,Redmond,WA,98052,425,555-2661,1968-01-01,2024-04-03 20:22:20
6,707,Kathryn,Patterson,554 E. Wilshire\r\nApt. 2A,Seattle,WA,98105,206,555-2697,1982-12-12,2024-04-03 20:22:20
7,708,Susan,McLain,511 Lenora Ave,Bellevue,WA,98006,425,555-2301,1967-10-15,2024-04-03 20:22:20